amore55/m5Dash/sdkconfig.defaults
# Tab5 Desk Dashboard — project defaults.
#
# Anything in here can be overridden per-developer in `sdkconfig` (git-ignored) via
# `idf.py menuconfig`. Keep this file authoritative: CI builds from a clean tree and
# therefore builds exactly this configuration.
#
# Sources for the non-obvious values:
#   * PSRAM / cache / flash        M5Tab5-UserDemo platforms/tab5/sdkconfig.defaults
#   * esp_hosted SDIO pin map      M5Tab5-UserDemo platforms/tab5/sdkconfig  (verified)
#   * BSP display options          espressif/esp-bsp bsp/m5stack_tab5/Kconfig

CONFIG_IDF_TARGET="esp32p4"

# ---------------------------------------------------------------------------------------
# Flash and partitions
# ---------------------------------------------------------------------------------------
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000

# ---------------------------------------------------------------------------------------
# PSRAM (32 MB) — required: LVGL buffers, TLS buffers and the JSON scratch all live here.
# CONFIG_SPIRAM_XIP_FROM_PSRAM needs IDF_EXPERIMENTAL_FEATURES on IDF 5.4.
# ---------------------------------------------------------------------------------------
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y

# ---------------------------------------------------------------------------------------
# DELIBERATELY NOT SET — these were copied from M5Tab5-UserDemo and are believed to be why
# the panel initially came up blank. Do not re-add without re-testing the display.
#
#   CONFIG_CACHE_L2_CACHE_LINE_128B
#       On the ESP32-P4 internal RAM sits behind the L2 cache, so LCD DMA buffers need cache
#       maintenance, and esp_cache_msync() requires the buffer to be aligned to the cache
#       LINE size. Raising the line from the default 64 B to 128 B doubles that requirement,
#       and esp_lvgl_port allocates its draw buffers with an unaligned heap_caps_malloc().
#       M5Stack get away with it because their demo uses a different rendering path.
#
#   CONFIG_CACHE_L2_CACHE_256KB
#       Harmless in itself, but changed together with the line size, so it is left at the
#       default until the display is proven stable.
#
#   CONFIG_SPIRAM_XIP_FROM_PSRAM
#       Executes .text/.rodata from PSRAM. Espressif's own reference configuration for this
#       board does not enable it, and it competes with the display for PSRAM bandwidth.
#
# Espressif's known-good reference for this board is
# esp-bsp/examples/display/sdkconfig.bsp.m5stack_tab5 — worth diffing against before
# blaming application code for a display problem.
# ---------------------------------------------------------------------------------------

# ---------------------------------------------------------------------------------------
# CPU / compiler
# ---------------------------------------------------------------------------------------
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_360=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# ---------------------------------------------------------------------------------------
# FreeRTOS / watchdog
#
# The task watchdog is left ON with a generous timeout. Every long-running task in this
# project either blocks on a queue/semaphore with a timeout or calls vTaskDelay, so it
# should never trip; if it does, that is a real bug and we want the reboot.
# ---------------------------------------------------------------------------------------
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_ESP_TASK_WDT_INIT=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=15
CONFIG_ESP_INT_WDT=y

# PANIC on a task-watchdog timeout rather than just printing a warning and carrying on.
#
# A hang that silently resets the device is close to undiagnosable; a hang that panics writes a
# backtrace to the console AND a core dump to flash, which `idf.py coredump-info` turns into the
# exact task and line. Trading a "recoverable" warning for a diagnosable crash is the right call
# on a device that is meant to run unattended for weeks — a task that stopped yielding is not
# actually recoverable, it is just failing quietly.
CONFIG_ESP_TASK_WDT_PANIC=y

# ---------------------------------------------------------------------------------------
# Bootloader / OTA / rollback
#
# APP_ROLLBACK_ENABLE makes the bootloader boot a freshly-written image in PENDING_VERIFY.
# If the app does not call esp_ota_mark_app_valid_cancel_rollback() the next reset falls
# back to the previous slot. AppController does that only after start-up checks pass.
# ---------------------------------------------------------------------------------------
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
CONFIG_BOOTLOADER_WDT_ENABLE=y
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
# Anti-rollback (efuse-based downgrade prevention) is deliberately OFF: it burns an efuse and
# is irreversible, which would make development flashing a one-way door.
CONFIG_BOOTLOADER_APP_ANTI_ROLLBACK=n

# ---------------------------------------------------------------------------------------
# Core dump to flash — so a crash after an OTA can be read back over USB.
# ---------------------------------------------------------------------------------------
CONFIG_ESP_COREDUMP_ENABLE_TO_FLASH=y
CONFIG_ESP_COREDUMP_DATA_FORMAT_ELF=y
CONFIG_ESP_COREDUMP_CHECKSUM_SHA256=y

# ---------------------------------------------------------------------------------------
# TLS. Certificate validation is ON and stays on.
#
# The full bundle is used because we talk to five unrelated hosts (open-meteo.com,
# api.tfl.gov.uk, api.telegram.org, objects.githubusercontent.com, api.claude.ai) whose
# roots are not all in the "common" subset. ASYMMETRIC_CONTENT_LEN keeps the 16 KB inbound
# record buffer without paying for a 16 KB outbound one.
# ---------------------------------------------------------------------------------------
CONFIG_ESP_TLS_USING_MBEDTLS=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_ASYMMETRIC_CONTENT_LEN=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096
CONFIG_MBEDTLS_HARDWARE_SHA=y
CONFIG_MBEDTLS_HARDWARE_AES=y

# mbedTLS allocates from PSRAM, not internal SRAM. NOT optional on this board.
#
# The default (CONFIG_MBEDTLS_INTERNAL_MEM_ALLOC) puts the 16 KB TLS input buffer, the output
# buffer and the whole certificate-chain parse into internal SRAM. There is ~500 KB of that in
# total on the ESP32-P4, and the display, LVGL and the esp_hosted SDIO driver have already taken
# most of it by the time a plugin fetches anything.
#
# Observed with the default, on the first HTTPS request the weather page made after boot:
#     E esp-aes: Failed to allocate memory for start alignment buffer
#     E esp-sha: Failed to allocate buf memory
#     E dma_utils: esp_dma_capable_malloc(181): Not enough heap memory
#     assert failed: sdio_rx_get_buffer sdio_drv.c:670 (*buf)
# — i.e. the TLS handshake exhausted internal RAM, then the Wi-Fi transport could not get a
# DMA buffer and asserted, panicking the device into a reboot loop. The total-free-heap figure
# stayed at 31 MB throughout, which is why the health report now prints internal and DMA
# separately: the number that matters was never on screen.
CONFIG_MBEDTLS_EXTERNAL_MEM_ALLOC=y

# Wi-Fi and lwIP buffers from PSRAM too, for the same reason and with a measured effect: with two
# plugins fetching, this raised the internal low-water mark from 23.4 KB to 28.2 KB. Note that it
# is TRY_ALLOCATE — anything that genuinely needs DMA-capable internal memory still gets it.
CONFIG_SPIRAM_TRY_ALLOCATE_WIFI_LWIP=y

# ---------------------------------------------------------------------------------------
# HTTP client / server
# ---------------------------------------------------------------------------------------
CONFIG_ESP_HTTP_CLIENT_ENABLE_HTTPS=y
CONFIG_ESP_TLS_INSECURE=n
CONFIG_HTTPD_MAX_REQ_HDR_LEN=1024
CONFIG_HTTPD_MAX_URI_LEN=512
CONFIG_ESP_HTTPS_OTA_ALLOW_HTTP=n

# ---------------------------------------------------------------------------------------
# lwIP / SNTP
# ---------------------------------------------------------------------------------------
CONFIG_LWIP_LOCAL_HOSTNAME="desk-dashboard"
CONFIG_LWIP_SNTP_MAX_SERVERS=2
CONFIG_LWIP_DHCP_GET_NTP_SRV=n
CONFIG_LWIP_SO_RCVBUF=y

# ---------------------------------------------------------------------------------------
# Wi-Fi via the ESP32-C6 coprocessor (esp_wifi_remote over esp_hosted / SDIO).
#
# THESE PINS ARE THE TAB5's — copied from M5Stack's own committed sdkconfig for this board.
# Do not "tidy" them. See docs/IMPLEMENTATION_PLAN.md §5.
#
# bsp_feature_enable(BSP_FEATURE_WIFI, true) must be called before esp_wifi_init(); the
# board's second IO expander gates power to the C6. tab5_board::Board::enableWifiRail()
# does this.
# ---------------------------------------------------------------------------------------
CONFIG_ESP_HOSTED_ENABLED=y
CONFIG_ESP_HOSTED_SDIO_HOST_INTERFACE=y
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_SDIO_4_BIT_BUS=y
CONFIG_ESP_HOSTED_SDIO_BUS_WIDTH=4
CONFIG_ESP_HOSTED_SDIO_CLOCK_FREQ_KHZ=40000
CONFIG_ESP_HOSTED_SDIO_PIN_CMD=13
CONFIG_ESP_HOSTED_SDIO_PIN_CLK=12
CONFIG_ESP_HOSTED_SDIO_PIN_D0=11
# D1 IS SPECIAL AND MUST BE SET VIA THE _PRIV_ SYMBOL.
#
# ESP_HOSTED_SDIO_PIN_D1 is declared in esp_hosted's Kconfig as a bare `int` with NO prompt —
# it is a derived symbol whose value comes from ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS (or the
# 1-bit equivalent). Setting CONFIG_ESP_HOSTED_SDIO_PIN_D1 here is therefore SILENTLY IGNORED,
# and D1 falls back to its ESP32-P4 default of 15 — which is also the slave reset pin.
#
# The result is a pin collision that presents as an SDIO enumeration failure and an abort inside
# hosted_sdio_card_fn_init(), i.e. a boot loop:
#
#   sdio_wrapper: GPIOs: CLK[12] CMD[13] D0[11] D1[15] D2[9] D3[8] Slave_Reset[15]
#   sdmmc_io: sdmmc_io_rw_extended: sdmmc_send_cmd returned 0xffffffff
#   sdio_wrapper: failed to get CIS data.
#
# Both keys are set: the _PRIV_ one because it is what actually takes effect, and the derived
# one for documentation and so a diff against M5Stack's configuration matches.
CONFIG_ESP_HOSTED_SDIO_PRIV_PIN_D1_4BIT_BUS=10
CONFIG_ESP_HOSTED_SDIO_PIN_D1=10
CONFIG_ESP_HOSTED_SDIO_PIN_D2=9
CONFIG_ESP_HOSTED_SDIO_PIN_D3=8
CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE=15
CONFIG_ESP_HOSTED_SDIO_RESET_ACTIVE_LOW=y
CONFIG_ESP_HOSTED_SDIO_OPTIMIZATION_RX_STREAMING_MODE=y
CONFIG_ESP_WIFI_REMOTE_LIBRARY_HOSTED=y

# ---------------------------------------------------------------------------------------
# Screen rotation via the ESP32-P4's Pixel Processing Accelerator.
#
# The panel is physically 720x1280 portrait; the UI is 1280x720 landscape. Without this,
# esp_lvgl_port rotates every flushed area on the CPU with lv_draw_sw_rotate(), which on a
# 921,600-pixel display is a lot of work to do in software when the SoC has dedicated
# hardware for exactly this.
#
# It also allocates its buffer with heap_caps_aligned_calloc() at the cache line size
# (lcd_ppa.c:59), whereas the software path uses a plain heap_caps_malloc() — which matters
# because the buffers live in PSRAM and are cache-synced.
#
# Requires SOC_PPA_SUPPORTED, which is 1 on the ESP32-P4. Defaults to n upstream.
# ---------------------------------------------------------------------------------------
# TEMPORARILY OFF while the display is being brought up: Espressif's reference config for this
# board does not enable it, and the goal right now is to match a known-good configuration
# exactly. Re-enable once a picture is confirmed — it is genuinely worth having, since it moves
# rotation off the CPU onto dedicated hardware.
CONFIG_LVGL_PORT_ENABLE_PPA=n

# ---------------------------------------------------------------------------------------
# M5Stack Tab5 BSP
#
# NOTE: tab5_board::Board::init() passes an explicit bsp_display_cfg_t and therefore does not
# use CONFIG_BSP_LCD_DRAW_BUF_HEIGHT. It is kept in step with the value in board.cpp so the
# two do not tell different stories.
#
# Draw buffers are 720 x 120 px x 2 B = 173 KB each, in DMA-capable PSRAM (not internal RAM).
# See the long comment in board.cpp: rotation needs a third buffer of the same size, and
# three of these do not fit in the ~243 KB largest internal block.
# ---------------------------------------------------------------------------------------
CONFIG_BSP_ERROR_CHECK=y
CONFIG_BSP_I2C_NUM=1
CONFIG_BSP_LCD_DRAW_BUF_HEIGHT=40
CONFIG_BSP_LCD_DRAW_BUF_DOUBLE=y
CONFIG_BSP_LCD_DPI_BUFFER_NUMS=1
CONFIG_BSP_LCD_USE_DMA2D=y
CONFIG_BSP_DISPLAY_BRIGHTNESS_LEDC_CH=1
CONFIG_BSP_DISPLAY_LVGL_AVOID_TEAR=n
CONFIG_BSP_SD_MOUNT_POINT="/sdcard"
CONFIG_BSP_SD_FORMAT_ON_MOUNT_FAIL=n

# ---------------------------------------------------------------------------------------
# LVGL 9
#
# CLIB malloc/string/sprintf: PSRAM-backed heap via the IDF allocator instead of LVGL's
# own fixed pool, so a large label or a task list cannot exhaust a private arena.
# Only the font sizes the theme actually uses are enabled, to keep the binary small.
# ---------------------------------------------------------------------------------------
CONFIG_LV_COLOR_DEPTH_16=y
# Custom malloc: LVGL allocates from PSRAM via components/dashboard_core/src/lvgl_heap.c.
# NOT CLIB malloc — SPIRAM_MALLOC_ALWAYSINTERNAL=16384 puts every sub-16KB malloc in
# internal SRAM, which measured at 47.5 KB of internal RAM for six resident pages.
CONFIG_LV_USE_CUSTOM_MALLOC=y
CONFIG_LV_USE_CLIB_STRING=y
CONFIG_LV_USE_CLIB_SPRINTF=y
CONFIG_LV_DEF_REFR_PERIOD=25
CONFIG_LV_DRAW_BUF_ALIGN=64
CONFIG_LV_ATTRIBUTE_FAST_MEM_USE_IRAM=y
CONFIG_LV_USE_PERF_MONITOR=n
CONFIG_LV_USE_MEM_MONITOR=n
CONFIG_LV_USE_LOG=y
CONFIG_LV_LOG_LEVEL_WARN=y
CONFIG_LV_LOG_PRINTF=y
CONFIG_LV_FONT_MONTSERRAT_12=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_16=y
CONFIG_LV_FONT_MONTSERRAT_18=y
CONFIG_LV_FONT_MONTSERRAT_20=y
CONFIG_LV_FONT_MONTSERRAT_22=y
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_36=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_FMT_TXT_LARGE=y
CONFIG_LV_USE_FONT_COMPRESSED=n
CONFIG_LV_USE_KEYBOARD=y
CONFIG_LV_USE_TEXTAREA=y
CONFIG_LV_USE_MSGBOX=y
CONFIG_LV_USE_SWITCH=y
CONFIG_LV_USE_SLIDER=y
CONFIG_LV_USE_ROLLER=y
CONFIG_LV_USE_LIST=y
CONFIG_LV_USE_BAR=y
CONFIG_LV_USE_SPINNER=y
CONFIG_LV_USE_ARC=y

# ---------------------------------------------------------------------------------------
# LittleFS (tasks + API response cache)
# ---------------------------------------------------------------------------------------
CONFIG_LITTLEFS_MAX_PARTITIONS=1
CONFIG_LITTLEFS_PAGE_SIZE=256
CONFIG_LITTLEFS_OBJ_NAME_LEN=64
CONFIG_LITTLEFS_FCNTL_GET_PATH=n

# ---------------------------------------------------------------------------------------
# Logging. INFO by default; the network and secret-bearing modules downgrade their own
# verbose output at compile time (see dashboard/log.hpp).
# ---------------------------------------------------------------------------------------
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_DEBUG=y
CONFIG_LOG_COLORS=y
